## Updating Pandas DataFrame Data

In [12]:
import pandas as pd
data = {'first':['ali','sepideh','nadia'],
        'last':['abdaal','hosseinian','masoumi'],
        'age':[30,33,29],
        'CH_count':[12,14,39]}
clients= pd.DataFrame(data)

### Adding Rows

In [13]:
new_data = {'first':['Mo','fariborz','emad'],
        'last':['haghighi','baghaie','arabshahi'],
        'age':[37,33,24],
        'CH_count':[50,45,39]}
new_set=pd.DataFrame(new_data)
new_clients= pd.concat([clients,new_set], ignore_index = True)
new_clients.reset_index()
display(new_clients)

      first        last  age  CH_count
0       ali      abdaal   30        12
1   sepideh  hosseinian   33        14
2     nadia     masoumi   29        39
3        Mo    haghighi   37        50
4  fariborz     baghaie   33        45
5      emad   arabshahi   24        39

### Setting Specific Value

In [16]:
new_clients.loc[0,'age']=29
new_clients.loc[0:1, 'CH_count']= -1

In [17]:
display(new_clients)

      first        last  age  CH_count
0       ali      abdaal   29        -1
1   sepideh  hosseinian   33        -1
2     nadia     masoumi   29        39
3        Mo    haghighi   37        50
4  fariborz     baghaie   33        45
5      emad   arabshahi   24        39

### Math Operation

In [18]:
new_clients.CH_count+1

0     0
1     0
2    40
3    51
4    46
5    40
Name: CH_count, dtype: int64

In [19]:
new_clients.CH_count-=3

In [20]:
new_clients

      first        last  age  CH_count
0       ali      abdaal   29        -4
1   sepideh  hosseinian   33        -4
2     nadia     masoumi   29        36
3        Mo    haghighi   37        47
4  fariborz     baghaie   33        42
5      emad   arabshahi   24        36

### Replace

In [21]:
new_clients.replace(-4,0)

      first        last  age  CH_count
0       ali      abdaal   29         0
1   sepideh  hosseinian   33         0
2     nadia     masoumi   29        36
3        Mo    haghighi   37        47
4  fariborz     baghaie   33        42
5      emad   arabshahi   24        36